Revit 2027 API
Transform.CreateRotation Method
 Creates a transform that represents a rotation about the given axis at (0, 0, 0).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Transform CreateRotation(
	XYZ axis,
	double angle
)
Public Shared Function CreateRotation (
	axis As XYZ,
	angle As Double
) As Transform
public:
static Transform^ CreateRotation(
	XYZ^ axis,
	double angle
)
static member CreateRotation :
        axis : XYZ *
        angle : float -> Transform
Parameters
axis XYZ
 The rotation axis.
angle Double
 The angle.
Return Value
Transform
 The new transform.
Exceptions
Exception | Condition
ArgumentException |  The given value for angle is not finite
ArgumentNullException |  A non-optional argument was NULL
ArgumentOutOfRangeException |  axis has zero length.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace